# vsoStateGetPos

## Description
```pascal
FUNCTION vsoStateGetPos(
				hObj        : HANDLE;
				VAR outX    : REAL;
				VAR outY    : REAL;
				VAR outZ    : REAL;
				VAR outIs3D : BOOLEAN) : BOOLEAN;
```

```python

def vs.vsoStateGetPos(hObj):
    return (BOOLEAN, outX, outY, outZ, outIs3D)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|outX|REAL||
|outY|REAL||
|outZ|REAL||
|outIs3D|BOOLEAN||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events